import type * as NumberDictionaryType from '../../types/NumberDictionaryType';

export const arabic_western: NumberDictionaryType.SymbolDictionarySource = {
    "name": "arabic_western",
    "label": "アラビア西部",
    "language": "Arabic Western (Maghreb, Europe)",
    "shapeMap": {
        "0": ["0", "𝟎", "𝟘", "𝟢", "𝟬", "𝟶",],
        "1": ["1", "𝟏", "𝟙", "𝟣", "𝟭", "𝟷",],
        "2": ["2", "𝟐", "𝟚", "𝟤", "𝟮", "𝟸",],
        "3": ["3", "𝟑", "𝟛", "𝟥", "𝟯", "𝟹",],
        "4": ["4", "𝟒", "𝟜", "𝟦", "𝟰", "𝟺",],
        "5": ["5", "𝟓", "𝟝", "𝟧", "𝟱", "𝟻",],
        "6": ["6", "𝟔", "𝟞", "𝟨", "𝟲", "𝟼",],
        "7": ["7", "𝟕", "𝟟", "𝟩", "𝟳", "𝟽",],
        "8": ["8", "𝟖", "𝟠", "𝟪", "𝟴", "𝟾",],
        "9": ["9", "𝟗", "𝟡", "𝟫", "𝟵", "𝟿",],
    },
};